Revit 2027 API
BuiltInFailures.RebarFailures.RebarConstraintWarning Property
 Structural rebar have automatic constraints that may conflict with dimensional constraints. Using dimensional constraints with structural rebar is not recommended and should be avoided.\nGrouped structural rebar is the only exception to this recommendation, since the automatic constraints are removed on grouped rebar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarConstraintWarning { get; }
Public Shared ReadOnly Property RebarConstraintWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarConstraintWarning {
	FailureDefinitionId^ get ();
}
static member RebarConstraintWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace